buzzwang1/pcb/scripts/stm/STM32U575.svd
        <register>
          <name>SPI_CRCPOLY</name>
          <displayName>SPI_CRCPOLY</displayName>
          <description>SPI polynomial register </description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000107</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial register
This register contains the polynomial for the CRC calculation.
The default 9-bit polynomial setting 0x107 corresponds to default 8-bit setting of DSIZE. It is compatible with setting 0x07 used at some other ST products with fixed length of the polynomial string where the most significant bit of the string is always kept hidden.
Length of the polynomial is given by the most significant bit of the value stored at this register. It has to be set greater than DSIZE. CRC33_17 bit has to be set additionally with CRCPOLY register when DSIZE is configured to maximum 32-bit or 16-bit size and CRC is enabled (to keep polynomial length grater than data size).
Note: CRCPOLY[31:16] bits are reserved at instances with data size limited to 16-bit. There is no constrain when 32-bit access is applied at these addresses. Reserved bits 31-16 are always read zero while any write to them is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_TXCRC</name>
          <displayName>SPI_TXCRC</displayName>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCRC</name>
              <description>CRC register for transmitter
When CRC calculation is enabled, the TXCRC[31:0] bits contain the computed CRC value of the subsequently transmitted bytes. CRC calculation is initialized when the CRCEN bit of SPI_CR1 is written to 1 or when a data block is transacted completely. The CRC is calculated serially using the polynomial programmed in the SPI_CRCPOLY register.
The number of bits considered at calculation depends on SPI_CRCPOLY register and CRCSIZE bits settings at SPI_CFG1 register.
Note: a read to this register when the communication is ongoing could return an incorrect value.
Note: TXCRC[31-16] bits are reserved at instances with data size limited to 16-bit. There is no constrain when 32-bit access is applied at these addresses. Reserved bits 31-16 are always read zero while any write to them is ignored.
Note: The configuration of CRCSIZE bit field is not taken into account when the content of this register is read by software. No masking is applied for unused bits at this case.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_RXCRC</name>
          <displayName>SPI_RXCRC</displayName>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>CRC register for receiver
When CRC calculation is enabled, the RXCRC[31:0] bits contain the computed CRC value of the subsequently received bytes. CRC calculation is initialized when the CRCEN bit of SPI_CR1 is written to 1 or when a data block is transacted completely. The CRC is calculated serially using the polynomial programmed in the SPI_CRCPOLY register.
The number of bits considered at calculation depends on SPI_CRCPOLY register and CRCSIZE bits settings at SPI_CFG1 register.
Note: a read to this register when the communication is ongoing could return an incorrect value.
RXCRC[31-16] bits are reserved at the peripheral instances with data size limited to 16-bit. There is no constrain when 32-bit access is applied at these addresses. Reserved bits 31-16 are always read zero while any write to them is ignored.
Note: The configuration of CRCSIZE bit field is not taken into account when the content of this register is read by software. No masking is applied for unused bits at this case.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_UDRDR</name>
          <displayName>SPI_UDRDR</displayName>
          <description>SPI underrun data register </description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UDRDR</name>
              <description>data at slave underrun condition
The register is taken into account in Slave mode and at underrun condition only. The number of bits considered depends on DSIZE bit settings of the SPI_CFG1 register. Underrun condition handling depends on setting UDRCFG bit at SPI_CFG1 register.
Note: UDRDR[31-16] bits are reserved at the peripheral instances with data size limited to 16-bit. There is no constraint when 32-bit access is applied at these addresses. Reserved bits 31-16 are always read zero while any write to them is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SEC_SPI1</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x50013000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>060</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SEC_SPI2</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
      <baseAddress>0x46002000</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>099</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SEC_SPI3</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x56002000</baseAddress>
    </peripheral>
    <peripheral>
        <name>TIM1</name>
		<description>Advanced-timers</description>
        <groupName>TIM</groupName>
		<baseAddress>0x40012C00</baseAddress>
		<addressBlock>
	    <offset>0x0</offset>
		<size>0x400</size>
		<usage>registers</usage>
		</addressBlock>
		<interrupt>
		<name>TIM1_BRK</name>
		<description>TIM1 Break - transition error -index error </description>
		<value>041</value>
		</interrupt>
		<interrupt>
	      <name>TIM1_UP</name>
		  <description>TIM1 Update</description>
		  <value>042</value>
		</interrupt>
		<interrupt>
		  <name>TIM1_TRG_COM</name>
		  <description>TIM1 Trigger and Commutation - direction change interrupt -index </description>
		  <value>043</value>
		</interrupt>
		<interrupt>
		  <name>TIM1_CC</name>
		  <description>TIM1 Capture Compare interrupt</description>
		  <value>044</value>
		</interrupt>
        <registers>
          <register>
            <name>TIM1_CR1</name>
            <displayName>TIM1_CR1</displayName>
            <description>TIM1 control register 1</description>
            <addressOffset>0x0</addressOffset>
            <size>16</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>CEN</name>
                <description>Counter enable
Note: External clock, gated mode and encoder mode can work only if the CEN bit has been previously set by software. However trigger mode can set the CEN bit automatically by hardware.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Counter disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Counter enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UDIS</name>
                <description>Update disable
This bit is set and cleared by software to enable/disable UEV event generation.
Counter overflow/underflow
Setting the UG bit
Update generation through the slave mode controller
Buffered registers are then loaded with their preload values.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>UEV enabled. The Update (UEV) event is generated by one of the following events:</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>UEV disabled. The Update event is not generated, shadow registers keep their value (ARR, PSC, CCRx). However the counter and the prescaler are reinitialized if the UG bit is set or if a hardware reset is received from the slave mode controller.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>URS</name>
                <description>Update request source
This bit is set and cleared by software to select the UEV event sources.
Counter overflow/underflow
Setting the UG bit
Update generation through the slave mode controller</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Any of the following events generate an update interrupt or DMA request if enabled. These events can be: </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Only counter overflow/underflow generates an update interrupt or DMA request if enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPM</name>
                <description>One pulse mode</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Counter is not stopped at update event</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Counter stops counting at the next update event (clearing the bit CEN)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIR</name>
                <description>Direction
Note: This bit is read only when the timer is configured in Center-aligned mode or Encoder mode.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Counter used as upcounter</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Counter used as downcounter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMS</name>
                <description>Center-aligned mode selection
Note: It is not allowed to switch from edge-aligned mode to center-aligned mode as long as the counter is enabled (CEN=1)</description>
                <bitOffset>5</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Edge-aligned mode. The counter counts up or down depending on the direction bit (DIR).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Center-aligned mode 1. The counter counts up and down alternatively. Output compare interrupt flags of channels configured in output (CCxS=00 in TIMx_CCMRx register) are set only when the counter is counting down.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>Center-aligned mode 2. The counter counts up and down alternatively. Output compare interrupt flags of channels configured in output (CCxS=00 in TIMx_CCMRx register) are set only when the counter is counting up.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Center-aligned mode 3. The counter counts up and down alternatively. Output compare interrupt flags of channels configured in output (CCxS=00 in TIMx_CCMRx register) are set both when the counter is counting up or down.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARPE</name>
                <description>Auto-reload preload enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIMx_ARR register is not buffered</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIMx_ARR register is buffered</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CKD</name>
                <description>Clock division
This bit-field indicates the division ratio between the timer clock (tim_ker_ck) frequency and the dead-time and sampling clock (tDTS)used by the dead-time generators and the digital filters (tim_etr_in, tim_tix),</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>tDTS=ttim_ker_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>tDTS=2*ttim_ker_ck</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>tDTS=4*ttim_ker_ck</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Reserved, do not program this value</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UIFREMAP</name>
                <description>UIF status bit remapping</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No remapping. UIF status bit is not copied to TIMx_CNT register bit 31.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Remapping enabled. UIF status bit is copied to TIMx_CNT register bit 31.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DITHEN</name>
                <description>Dithering enable
Note: The DITHEN bit can only be modified when CEN bit is reset.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Dithering disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Dithering enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
		  <register>
            <name>TIM1_CR2</name>
            <displayName>TIM1_CR2</displayName>
            <description>control register 2</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
		    <fields>
				<field>
				  <name>MMS_3</name>
				  <description>Master mode selection 2</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MMS2</name>
				  <description>Master mode selection 2</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>OIS6</name>
				  <description>Output Idle state 6</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS5</name>
				  <description>Output Idle state 5</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS4N</name>
				  <description>Output Idle state 4 (OC5
				  output)</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS4</name>
				  <description>Output Idle state 4</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS3N</name>
				  <description>Output Idle state 3</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS3</name>
				  <description>Output Idle state 3</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS2N</name>
				  <description>Output Idle state 2</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS2</name>
				  <description>Output Idle state 2</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS1N</name>
				  <description>Output Idle state 1</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>OIS1</name>
				  <description>Output Idle state 1</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>TI1S</name>
				  <description>TI1 selection</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MMS0_2</name>
				  <description>Master mode selection</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>CCDS</name>
				  <description>Capture/compare DMA
				  selection</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CCUS</name>
				  <description>Capture/compare control update
				  selection</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>CCPC</name>
				  <description>Capture/compare preloaded
				  control</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
			</fields>
          </register>
